import React from 'react';
import styles from './services.module.css';
import Title from "@/components/elements/Title/Title";
import ServiceCard from "@/components/elements/ServiceCard/ServiceCard";

const Services = () => {
	const services = [
		{
			img: "./s1.jpg", title: "Гадание и предсказание", options: [
				"Гадание на будущее",
				"Предсказание на картах Таро",
				"Гадание на воске",
				"Гадание на рунах"
			]
		},
		{
			img: "./s2.jpg", title: "Любовная магия", options: [
				"Приворот любимого",
				"Отворот от любовницы",
				"Вернуть любимого",
				"Снятие негативных влияний"
			]
		},
		{
			img: "./s4.jpg", title: "Воссоединение семьи", options: [
				"Налаживание отношений",
				"Заговоры на верность",
				"Примерение семьи",
				"Гарманония в отношениях"
			]
		}, {
			img: "./s11.jpg", title: "Приворот и Отворот", options: [
				"Приворот",
				"Отворот",
				"Снятие приворота",
				"Возврат мужа/жены"
			]
		}, {
			img: "./s3.jpg", title: "Снятие порчи и сглаза", options: [
				"Избавление от порчи",
				"Очистка от сглаза",
				"Устранение проклятия",
				"Установка защиты"
			]
		}, {
			img: "./s6.jpg", title: "Черная и белая магия", options: [
				"Обряды белой магии",
				"Обряды черной магии",
				"Черный приворот",
				"Наведение порчи"
			]
		}, {
			img: "./s8.jpg", title: "Одиночество и венец безбрачия", options: [
				"Снятие венца безбрачия",
				"Снятие покрывала одиночества",
				"Помощь в поиске любви",
				"Снятие негатива"
			]
		}, {
			img: "./s7.jpg", title: "Устранение соперницы", options: [
				"Отворот соперницы",
				"Отворот любовника",
				"Снятие сглаза с отношений",
				"Отворот от мужа/жены"
			]
		}, {
			img: "./s17.png", title: "Вернуть мужа или жену", options: [
				"Восстановление счастья",
				"Восстановление любви",
				"Приворот мужа/жены",
				"Привязка человека"
			]
		}, {
			img: "./s5.jpg", title: "Финансовая магия", options: [
				"Установка на удачу",
				"Снятие денежной порчи",
				"Обряды на торговлю",
				"Заговоры на успех"
			]
		}, {
			img: "./s9.jpg", title: "Установка защиты", options: [
				"Зеркальная защита",
				"Отворот от дурных взглядов",
				"Восстановление сил",
				"Заговоры на защиту"
			]
		},
		{
			img: "./s6.png", title: "Обряды и заговоры", options: [
				 "на ситуации",
				 "на любовь",
				"на работу",
				"на счастье"
			]
		},
	];
	
	
	return (
		<section className={`${styles.services} section-c`}>
			<div className="container-c">
				<Title title="Мои услуги"/>
				<ul className={styles.services__list}>
					{services.map((item, i) => {
						return (<>
							<ServiceCard title={item.title} img={item.img} option={item.options}/>
						
						</>)
					})}
				</ul>
				
			</div>
		</section>
	);
};

export default Services;
